import { IskillDetails } from "types/skillDetails-types";

export const skillDetails:IskillDetails[] = [
    {
        id: 1,
        detailedDescription: "HTML — это основа веб-разработки. Я использую его для создания структуры веб-страниц, включая заголовки, параграфы, списки и формы. Также я знаком с семантической разметкой, что помогает улучшить доступность и SEO.",
    },
    {
        id: 2,
        detailedDescription: "CSS — это язык стилей, который я использую для оформления веб-страниц. Я работаю с Flexbox и Grid для создания адаптивных макетов, а также использую анимации и медиа-запросы для улучшения пользовательского опыта.",
    },
    {
        id: 3,
        detailedDescription: "JavaScript — это язык, который я использую для добавления интерактивности на веб-страницы. Я знаком с основами языка, такими как функции, циклы и обработка событий, а также работаю с DOM для динамического изменения содержимого страницы.",
    },
    {
        id: 4,
        detailedDescription: "React — это библиотека JavaScript, которую я использую для создания пользовательских интерфейсов. Я знаком с компонентами, хуками и управлением состоянием. Также я изучаю React Router для маршрутизации в приложениях.",
    },
    {
        id: 5,
        detailedDescription: "TypeScript — это строго типизированное надмножество JavaScript. Я использую его для улучшения качества кода, предотвращения ошибок и упрощения рефакторинга. Я знаком с интерфейсами, типами и дженериками.",
    },
    {
        id: 6,
        detailedDescription: "PHP — это серверный язык программирования, который я изучаю для создания веб-приложений. Я знаком с основами языка, такими как переменные, циклы и функции, а также работаю с базами данных MySQL.",
    },
    {
        id: 7,
        detailedDescription: "Angular — это фреймворк для создания одностраничных приложений. Я изучаю его основы, такие как компоненты, директивы и сервисы. Также я знаком с TypeScript, который используется в Angular.",
    },
    {
        id: 8,
        detailedDescription: "jQuery — это библиотека JavaScript, которая упрощает работу с DOM. Я использую её для обработки событий, анимаций и AJAX-запросов. Хотя сейчас я больше сосредоточен на нативном JavaScript, jQuery всё ещё полезен для поддержки старых проектов.",
    },
];